app/views/teams/show.html.erb

SELECT "riders".* FROM "riders" WHERE "riders"."team_id" = ?  [["team_id", 5]]
---
	<strong>Riders:</strong>
  <% @team.riders.each do |riders| %>