app/controllers/circuits_controller.rb

  def index
    @circuits = Circuit.all
---
SELECT "circuits".* FROM "circuits" WHERE "circuits"."deleted_at" IS NULL

  def create
    @circuit = Circuit.new(circuit_params)

    respond_to do |format|
      if @circuit.save!
---
INSERT INTO "circuits" ("name", "location", "distance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "m ,m "], ["location", ",km"], ["distance", 986.0], ["created_at", "2017-08-04 09:28:21.286628"], ["updated_at", "2017-08-04 09:28:21.286628"]]

  def update
    respond_to do |format|
      if @circuit.update!(circuit_params)
---
UPDATE "circuits" SET "location" = $1, "updated_at" = $2 WHERE "circuits"."id" = $3  [["location", "Albi"], ["updated_at", "2017-08-04 11:33:50.959441"], ["id", 3]]

  def destroy
    @circuit.destroy
---
DELETE FROM "circuits" WHERE "circuits"."id" = ?  [["id", 1]]

    def set_circuit
      @circuit = Circuit.find(params[:id])
---
SELECT  "circuits".* FROM "circuits" WHERE "circuits"."deleted_at" IS NULL AND "circuits"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]