app/controllers/riders_controller.rb

  def index
    @riders = Rider.all
---
SELECT "riders".* FROM "riders"

  def create
    @rider = Rider.new(rider_params)

    respond_to do |format|
      if @rider.save
---
INSERT INTO "riders" ("name", "nation", "bike", "number", "created_at", "updated_at", "team_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Rossi"], ["nation", "Italy"], ["bike", "yamaha"], ["number", 46], ["created_at", "2017-07-27 12:51:01.974906"], ["updated_at", "2017-07-27 12:51:01.974906"], ["team_id", 5]]

  def update
    respond_to do |format|
      if @rider.update(rider_params)
---
UPDATE "riders" SET "nation" = ?, "bike" = ?, "number" = ?, "updated_at" = ? WHERE "riders"."id" = ?  [["nation", "italy"], ["bike", "yamaha"], ["number", 46], ["updated_at", "2017-07-27 10:14:11.260246"], ["id", 2]]

  def destroy
    @rider.destroy
---
DELETE FROM "riders" WHERE "riders"."id" = ?  [["id", 1]]

    def set_rider
      @rider = Rider.find(params[:id])
---
SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]